// ==============================================================================
//  ■ IPlayableMedia
// ------------------------------------------------------------------------------
//  재생 가능한 미디어 및 연출에서 사용하는 인터페이스
// ==============================================================================

public interface IPlayableMedia
{
    // --------------------------------------------------------------------------
    //  ● 재생 상태를 변경하는 메서드
    // --------------------------------------------------------------------------
    public void Play();      // 재생
    public void Pause();     // 일시정지
    public void Resume();    // 재개
    public void Stop();      // 처음 상태로 정지
    public void Replay();    // 처음부터 다시 재생
    public void Complete();  // 즉시 완료
    public void Kill();      // 현재 상태 그대로 정지
}
